src/AccumulationRegisters/ТоварыВРезервеНаСкладах/ТоварыВРезервеНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезервеНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыРегистровОснованийРегистраСвободныеОстатки/ВидыРегистровОснованийРегистраСвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРегистровОснованийРегистраСвободныеОстатки</name>
  <enumValues>
    <name>ТоварыВРезервеНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ТоварыВРознице</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКПередачеСоСкладов</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладах</name>
  </enumValues>
</mdclass:Enum>

src/AccumulationRegisters/ТоварыВРезервеНаСкладах/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
		
	Если НЕ ОбменДанными.Загрузка Тогда
		
		КорректировкаСерийПриРезервировании();
		
		ОбщегоНазначения.ВыполнитьДвиженияПоРегиструСвободныеОстатки(ЭтотОбъект, Отбор.Регистратор.Значение, Замещение, Перечисления.ВидыРегистровОснованийРегистраСвободныеОстатки.ТоварыВРезервеНаСкладах, Отказ);

	КонецЕсли;
	
КонецПроцедуры

Процедура КорректировкаСерийПриРезервировании()
	
	// Если в таблице движений нет серий, то модифицировать ничего не нужно.
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();

	// Если серии при резервировании не используются, тогда очистим колонку "СерииНоменклатуры".
	Если Не (глЗначениеПеременной("ИспользоватьУказаниеСерийНоменклатурыПриРезервировании") И глЗначениеПеременной("ИспользоватьСерииНоменклатуры")) Тогда
	
		Для Каждого СтрокаДвижения Из ЭтотОбъект Цикл
			СтрокаДвижения.СерияНоменклатуры = ПустаяСерия;
		КонецЦикла;	
	
	Иначе
	
		// Для каждого заказа определим ведется ли обособленный учет, если нет, очистим серию.
		Для Каждого СтрокаДвижения Из ЭтотОбъект Цикл
			
			Если ТипЗнч(СтрокаДвижения.ДокументРезерва) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				СтрокаДвижения.СерияНоменклатуры = ПустаяСерия;
				Продолжить;
			КонецЕсли;	
			
			ОбособленныйУчетПоЗаказу = СтрокаДвижения.ДокументРезерва.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей;
			
			Если Не(ОбособленныйУчетПоЗаказу) Тогда
				СтрокаДвижения.СерияНоменклатуры = ПустаяСерия;
			КонецЕсли;	
			
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры
